УТ_для_edt/src/Catalogs/смартИсточникиРекламногоВоздействия/смартИсточникиРекламногоВоздействия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартИсточникиРекламногоВоздействия</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Канал</name>
    <comment>#1462 смарт: Фролов 04.12.2024 / ИМ. Разделение лидов по источникам</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.КаналыРекламныхВоздействий</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешеноИспользоватьВЗаказеКлиента</name>
    <comment>//++ #Б-3864 смарт: Фролов 17.07.2025 //Выбор в заказе клиента только разрешенных Источников рекламного взаимодействия. </comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <comment>//++ #Б-4932 смарт: Фролов 10.11.2025 //Доработка справочника Источники рекламного взаимодействия. </comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <comment>//++ #Б-4932 смарт: Фролов 10.11.2025 //Доработка справочника Источники рекламного взаимодействия. </comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОборудованиеИОператоры</name>
    <comment>//++ #Б-4932 смарт: Фролов 07.11.2025 //Доработка справочника Источники рекламного взаимодействия.</comment>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Оператор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <comment>//++ #Б-4962 смарт: Фролов 12.11.2025 //Доработка справочника Источники Рекламного взаимодействия.</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <comment>//++ #Б-5018 смарт: Фролов 19.11.2025 //Корректировка справочника Источники Рекламного взаимодействия</comment>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АвтоматическоеПроставлениеВЗаказеКлиента</name>
    <comment>//++ #Б-6636 смарт: Фролов 22.04.2026 //В спр.Партнеры реализовать возможность отражения посещения наших мероприятий/выставок.</comment>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Марки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/InformationRegisters/СостоянияЗаказовКлиентов/СостоянияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияЗаказовКлиентов</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияЗаказовКлиентов</types>
      <types>EnumRef.СостоянияЗаявокНаВозвратТоваровОтКлиентов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СуммаОплаты</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОтгрузки</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОтгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДолга</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьРасхожденияОрдерНакладная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартДокументыПодписаны</name>
    <comment>//++ #1650 смарт:Шляпников 17.09.2024 //Отметка &quot;Оригиналы документов получены&quot; (Заказ клиента) при частичной отгрузке (1650)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеРассчитана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставке</name>
    <type>
      <types>CatalogRef.СкидкиНаценки</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеРассчитанаСОшибкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеПоТарифу</name>
    <type>
      <types>CatalogRef.СкидкиНаценки</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеСуммаПоТарифу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/СтатусыЗаказовКлиентов/СтатусыЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаказовКлиентов</name>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>КОбеспечению</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/смартИсточникиРекламногоВоздействия/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
//++ #Б-4962 смарт: Фролов 12.11.2025 //Доработка справочника Источники Рекламного взаимодействия. 
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Пользователи.РолиДоступны("смартДобавлениеИзменениеРекламныхИсточников") Тогда
	
		Элементы.Код.ТолькоПросмотр = Истина;
		Элементы.Наименование.ТолькоПросмотр = Истина;
		Элементы.Родитель.ТолькоПросмотр = Истина;
		Элементы.Канал.ТолькоПросмотр = Истина;
		Элементы.РазрешеноИспользоватьВЗаказеКлиента.ТолькоПросмотр = Истина;
		Элементы.ДатаНачала.ТолькоПросмотр = Истина;
		Элементы.ДатаОкончания.ТолькоПросмотр = Истина;
		Элементы.ОборудованиеИОператорыПроцент.ТолькоПросмотр = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры //-- #Б-4962 смарт: Фролов 12.11.2025

&НаКлиенте
//++ #Б-4962 смарт: Фролов 12.11.2025 //Доработка справочника Источники Рекламного взаимодействия.
Процедура ОборудованиеИОператорыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если НоваяСтрока Тогда
		
		Элемент.ТекущиеДанные.Процент = 1;	
		
	КонецЕсли;	
	
КонецПроцедуры //-- #Б-4962 смарт: Фролов 12.11.2025

&НаСервере
//++ #Б-5018 смарт: Фролов 19.11.2025 //Корректировка справочника Источники Рекламного взаимодействия
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТаблицаПроверки = Новый ТаблицаЗначений;
	ТаблицаПроверки.Колонки.Добавить("Оборудование");
	ТаблицаПроверки.Колонки.Добавить("Партнер");
	
	Для Каждого СтрОборудованиеИОператоры Из Объект.ОборудованиеИОператоры Цикл
		
		СтрокиТаблицаПроверки = ТаблицаПроверки.НайтиСтроки(Новый Структура("Оборудование, Партнер", 
			СтрОборудованиеИОператоры.Оборудование, СтрОборудованиеИОператоры.Партнер));
			
		Если СтрокиТаблицаПроверки.Количество() > 0 Тогда
			
			ОбщегоНазначения.СообщитьПользователю("Обнаружены дубли оборудования и партнера, запись не возможна!");
			Отказ = Истина;		
			
		Иначе
			
			СтрТаблицаПроверки = ТаблицаПроверки.Добавить();
			СтрТаблицаПроверки.Оборудование = СтрОборудованиеИОператоры.Оборудование; 
			СтрТаблицаПроверки.Партнер = СтрОборудованиеИОператоры.Партнер;
				
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры //-- #Б-5018 смарт: Фролов 19.11.2025

#КонецОбласти  

&НаСервере
//++ #Б-4962 смарт: Фролов 19.11.2025 //Доработка справочника Источники Рекламного взаимодействия.
Процедура ЗаполнитьИзЗаказовНаСервере()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента,
	|	ЗаказКлиентаТовары.РекламноеВоздействие КАК РекламноеВоздействие,
	|	ЗаказКлиентаТовары.Номенклатура КАК Оборудование,
	|	ЗаказКлиентаТовары.Ссылка.Партнер КАК Клиент
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|		ПО ЗаказКлиентаТовары.Ссылка = СостоянияЗаказовКлиентов.Заказ
	|ГДЕ
	|	ЗаказКлиентаТовары.РекламноеВоздействие = &РекламноеВоздействие
	|	И ЗаказКлиентаТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Закрыт)
	|	И НЕ ЗаказКлиентаТовары.Отменено
	|	И СостоянияЗаказовКлиентов.ПроцентОплаты > 0");
	Запрос.УстановитьПараметр("РекламноеВоздействие", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокиОборудование = Объект.ОборудованиеИОператоры.НайтиСтроки(Новый Структура("Оборудование", Выборка.Оборудование));

		Если СтрокиОборудование.Количество() = 0 Тогда
			
			СтрОборудованиеИОператоры = Объект.ОборудованиеИОператоры.Добавить();
			СтрОборудованиеИОператоры.Оборудование = Выборка.Оборудование;
			СтрОборудованиеИОператоры.Процент = 1;
			
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры //-- #Б-4962 смарт: Фролов 19.11.2025

&НаКлиенте
//++ #Б-4962 смарт: Фролов 19.11.2025 //Доработка справочника Источники Рекламного взаимодействия.
Процедура ЗаполнитьИзЗаказов(Команда)
	ЗаполнитьИзЗаказовНаСервере();
КонецПроцедуры //-- #Б-4962 смарт: Фролов 19.11.2025
